In [4]:
import pandas as pd
import numpy as np

In [5]:
speeds = pd.DataFrame(

    [

        ("bird", "Falconiformes", 389.0),

        ("bird", "Psittaciformes", 24.0),

        ("mammal", "Carnivora", 80.2),

        ("mammal", "Primates", np.nan),

        ("mammal", "Carnivora", 58),

    ],

    index=["falcon", "parrot", "lion", "monkey", "leopard"],

    columns=("class", "order", "max_speed"),

)



speeds

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [6]:
grouped = speeds.groupby("class")

In [8]:
grouped

In [7]:
grouped = speeds.groupby(["class", "order"])

In [9]:
grouped

In [10]:
df = pd.DataFrame(

    {

        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],

        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],

        "C": np.random.randn(8),

        "D": np.random.randn(8),

    }

)



df

     A      B         C         D
0  foo    one -0.508504 -0.300867
1  bar    one -2.902925  0.941785
2  foo    two -0.799524  0.800131
3  bar  three  0.761373 -0.721042
4  foo    two -0.514624  1.171055
5  bar    two  0.038246 -0.037845
6  foo    one -0.378629 -0.405836
7  foo  three -0.575681  1.412087

In [11]:
grouped = df.groupby("A")

grouped = df.groupby("B")

grouped = df.groupby(["A", "B"])

In [14]:
df2 = df.set_index(["A", "B"])

In [15]:
df2.index.names.difference(["B"])

FrozenList(['A'])

In [16]:
grouped = df2.groupby(level=df2.index.names.difference(["B"]))

grouped.sum()

            C         D
A
bar -2.103306  0.182897
foo -2.776962  2.676570

In [17]:
df

     A      B         C         D
0  foo    one -0.508504 -0.300867
1  bar    one -2.902925  0.941785
2  foo    two -0.799524  0.800131
3  bar  three  0.761373 -0.721042
4  foo    two -0.514624  1.171055
5  bar    two  0.038246 -0.037845
6  foo    one -0.378629 -0.405836
7  foo  three -0.575681  1.412087

In [18]:
df.T

,0,1,2,3,4,5,6,7
A,foo,bar,foo,bar,foo,bar,foo,foo
B,one,one,two,three,two,two,one,three
C,-0.508504,-2.902925,-0.799524,0.761373,-0.514624,0.038246,-0.378629,-0.575681
D,-0.300867,0.941785,0.800131,-0.721042,1.171055,-0.037845,-0.405836,1.412087

In [19]:
def get_letter_type(letter):

    if letter.lower() in 'aeiou':

        return 'vowel'

    else:

        return 'consonant'



grouped = df.T.groupby(get_letter_type)

In [22]:
list(grouped)

[('consonant',
            0         1         2         3         4         5         6  \
  B       one       one       two     three       two       two       one
  C -0.508504 -2.902925 -0.799524  0.761373 -0.514624  0.038246 -0.378629
  D -0.300867  0.941785  0.800131 -0.721042  1.171055 -0.037845 -0.405836

            7
  B     three
  C -0.575681
  D  1.412087  ),
 ('vowel',
       0    1    2    3    4    5    6    7
  A  foo  bar  foo  bar  foo  bar  foo  foo)]

In [21]:
dict(list(grouped))

{'consonant':           0         1         2         3         4         5         6  \
 B       one       one       two     three       two       two       one
 C -0.508504 -2.902925 -0.799524  0.761373 -0.514624  0.038246 -0.378629
 D -0.300867  0.941785  0.800131 -0.721042  1.171055 -0.037845 -0.405836

           7
 B     three
 C -0.575681
 D  1.412087  ,
 'vowel':      0    1    2    3    4    5    6    7
 A  foo  bar  foo  bar  foo  bar  foo  foo}

In [23]:
index = [1, 2, 3, 1, 2, 3]

s = pd.Series([1, 2, 3, 10, 20, 30], index=index)

s

1     1
2     2
3     3
1    10
2    20
3    30
dtype: int64

In [24]:
grouped = s.groupby(level=0)

grouped.first()

1    1
2    2
3    3
dtype: int64

In [25]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [26]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [27]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})

df2.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [28]:
df2.groupby(["X"], sort=False).sum()

   Y
X
B  3
A  7

In [30]:
df3 = pd.DataFrame({"X": ["A", "B", "A", "B"], "Y": [1, 4, 3, 2]})
df3

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [31]:
df3.groupby("X").get_group("A")

   X  Y
0  A  1
2  A  3

In [32]:
df3.groupby(["X"]).get_group(("B",))

   X  Y
1  B  4
3  B  2

In [37]:
grouped = df3.groupby(["X"])
for group in df3.groupby(["X"]):
    print(grouped.get_group(group[0]))
    print()

   X  Y
0  A  1
2  A  3

   X  Y
1  B  4
3  B  2

In [38]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

df_dropna = pd.DataFrame(df_list, columns=["a", "b", "c"])

df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [39]:
# Default ``dropna`` is set to True, which will exclude NaNs in keys

df_dropna.groupby(by=["b"], dropna=True).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [40]:
df_dropna.groupby(by=["a"], dropna=True).sum()

     b  c
a
1  4.0  9
2  1.0  3

In [41]:
# In order to allow NaN in keys, set ``dropna`` to False

df_dropna.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [42]:
df_dropna.groupby(by=["a"], dropna=False).sum()

     b  c
a
1  4.0  9
2  1.0  3

In [46]:
df

     A      B         C         D
0  foo    one -0.508504 -0.300867
1  bar    one -2.902925  0.941785
2  foo    two -0.799524  0.800131
3  bar  three  0.761373 -0.721042
4  foo    two -0.514624  1.171055
5  bar    two  0.038246 -0.037845
6  foo    one -0.378629 -0.405836
7  foo  three -0.575681  1.412087

In [43]:
df.groupby("A").groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [44]:
type(df.groupby("A").groups)

pandas.io.formats.printing.PrettyDict

In [45]:
df.T.groupby(get_letter_type).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [47]:
grouped = df.groupby(["A", "B"])

grouped.groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [48]:
len(grouped)

6

In [49]:
n = 10

weight = np.random.normal(166, 20, size=n)

height = np.random.normal(60, 10, size=n)

time = pd.date_range("1/1/2000", periods=n)

gender = np.random.choice(["male", "female"], size=n)

df = pd.DataFrame(

    {"height": height, "weight": weight, "gender": gender}, index=time

)



df

               height      weight  gender
2000-01-01  70.061278  151.952109  female
2000-01-02  48.641225  184.315163    male
2000-01-03  78.057669  180.824030    male
2000-01-04  55.084145  183.839620  female
2000-01-05  47.292636  166.699377    male
2000-01-06  55.304786  170.528019  female
2000-01-07  73.073936  200.049017    male
2000-01-08  60.743282  189.559258  female
2000-01-09  65.020631  177.442042  female
2000-01-10  62.595845  196.619704  female

In [50]:
gb = df.groupby("gender")

In [51]:
gb.groups

{'female': [2000-01-01 00:00:00, 2000-01-04 00:00:00, 2000-01-06 00:00:00, 2000-01-08 00:00:00, 2000-01-09 00:00:00, 2000-01-10 00:00:00], 'male': [2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-05 00:00:00, 2000-01-07 00:00:00]}

In [53]:
arrays = [

    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],

    ["one", "two", "one", "two", "one", "two", "one", "two"],

]



index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

s = pd.Series(np.random.randn(8), index=index)

s

first  second
bar    one      -1.465595
       two      -0.456278
baz    one      -0.442034
       two      -0.831861
foo    one      -0.133509
       two      -1.466570
qux    one      -0.690014
       two      -1.161049
dtype: float64

In [54]:
grouped = s.groupby(level=0)

grouped.sum()

first
bar   -1.921873
baz   -1.273894
foo   -1.600079
qux   -1.851063
dtype: float64

In [55]:
s.groupby(level="second").sum()

second
one   -2.731152
two   -3.915757
dtype: float64

In [56]:
arrays = [

    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],

    ["doo", "doo", "bee", "bee", "bop", "bop", "bop", "bop"],

    ["one", "two", "one", "two", "one", "two", "one", "two"],

]



index = pd.MultiIndex.from_arrays(arrays, names=["first", "second", "third"])

s = pd.Series(np.random.randn(8), index=index)

s

first  second  third
bar    doo     one      0.409432
               two     -1.027449
baz    bee     one     -0.559599
               two     -0.481016
foo    bop     one      2.722502
               two     -0.789998
qux    bop     one      0.648725
               two      1.583975
dtype: float64

In [59]:
s.groupby(level=["second", "third"]).sum()

second  third
bee     one     -0.559599
        two     -0.481016
bop     one      3.371227
        two      0.793977
doo     one      0.409432
        two     -1.027449
dtype: float64

In [58]:
s.groupby(["first", "second"]).sum()

first  second
bar    doo      -0.618017
baz    bee      -1.040615
foo    bop       1.932504
qux    bop       2.232700
dtype: float64

In [60]:
arrays = [

    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],

    ["one", "two", "one", "two", "one", "two", "one", "two"],

]



index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

df = pd.DataFrame({"A": [1, 1, 1, 1, 2, 2, 3, 3], "B": np.arange(8)}, index=index)

df

              A  B
first second
bar   one     1  0
      two     1  1
baz   one     1  2
      two     1  3
foo   one     2  4
      two     2  5
qux   one     3  6
      two     3  7

In [61]:
df.groupby([pd.Grouper(level=1), "A"]).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [67]:
df.groupby(["second", "A"]).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [68]:
df = pd.DataFrame(

    {

        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],

        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],

        "C": np.random.randn(8),

        "D": np.random.randn(8),

    }

)


df

     A      B         C         D
0  foo    one -2.303007 -0.124828
1  bar    one  0.530011 -2.152640
2  foo    two -1.365241 -0.329209
3  bar  three  0.790238  0.372214
4  foo    two  1.834747  1.229227
5  bar    two  0.946750 -0.955417
6  foo    one  0.117235 -0.349089
7  foo  three  0.776245  0.978859

In [69]:
grouped = df.groupby(["A"])

grouped_C = grouped["C"]

grouped_D = grouped["D"]

In [70]:
grouped.groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [76]:
grouped_C

In [77]:
df["C"].groupby(df["A"])

In [78]:
grouped[["A", "B"]].sum()

                   A                  B
A
bar        barbarbar        onethreetwo
foo  foofoofoofoofoo  onetwotwoonethree

In [79]:
grouped = df.groupby('A')

for name, group in grouped:

    print(name)

    print(group)

bar
     A      B         C         D
1  bar    one  0.530011 -2.152640
3  bar  three  0.790238  0.372214
5  bar    two  0.946750 -0.955417
foo
     A      B         C         D
0  foo    one -2.303007 -0.124828
2  foo    two -1.365241 -0.329209
4  foo    two  1.834747  1.229227
6  foo    one  0.117235 -0.349089
7  foo  three  0.776245  0.978859

In [80]:
for name, group in df.groupby(['A', 'B']):

    print(name)

    print(group)

('bar', 'one')
     A    B         C        D
1  bar  one  0.530011 -2.15264
('bar', 'three')
     A      B         C         D
3  bar  three  0.790238  0.372214
('bar', 'two')
     A    B        C         D
5  bar  two  0.94675 -0.955417
('foo', 'one')
     A    B         C         D
0  foo  one -2.303007 -0.124828
6  foo  one  0.117235 -0.349089
('foo', 'three')
     A      B         C         D
7  foo  three  0.776245  0.978859
('foo', 'two')
     A    B         C         D
2  foo  two -1.365241 -0.329209
4  foo  two  1.834747  1.229227

In [81]:
grouped.get_group("bar")

     A      B         C         D
1  bar    one  0.530011 -2.152640
3  bar  three  0.790238  0.372214
5  bar    two  0.946750 -0.955417

In [82]:
df.groupby(["A", "B"]).get_group(("bar", "one"))

     A    B         C        D
1  bar  one  0.530011 -2.15264

In [87]:
animals = pd.DataFrame(

    {

        "kind": ["cat", "dog", "cat", "dog", "bird"],

        "height": [9.1, 6.0, 9.5, 34.0, 5.0],

        "weight": [7.9, 7.5, 9.9, 198.0, 20.0],

    }

)

animals

   kind  height  weight
0   cat     9.1     7.9
1   dog     6.0     7.5
2   cat     9.5     9.9
3   dog    34.0   198.0
4  bird     5.0    20.0

In [88]:
animals.groupby("kind").sum()

      height  weight
kind
bird     5.0    20.0
cat     18.6    17.8
dog     40.0   205.5

In [89]:
animals.groupby("kind", as_index=False).sum()

   kind  height  weight
0  bird     5.0    20.0
1   cat    18.6    17.8
2   dog    40.0   205.5

In [90]:
df

     A      B         C         D
0  foo    one -2.303007 -0.124828
1  bar    one  0.530011 -2.152640
2  foo    two -1.365241 -0.329209
3  bar  three  0.790238  0.372214
4  foo    two  1.834747  1.229227
5  bar    two  0.946750 -0.955417
6  foo    one  0.117235 -0.349089
7  foo  three  0.776245  0.978859

In [91]:
df.groupby("A")[["C", "D"]].max()

            C         D
A
bar  0.946750  0.372214
foo  1.834747  1.229227

In [92]:
df.groupby(["A", "B"]).mean()

                  C         D
A   B
bar one    0.530011 -2.152640
    three  0.790238  0.372214
    two    0.946750 -0.955417
foo one   -1.092886 -0.236958
    three  0.776245  0.978859
    two    0.234753  0.450009

In [95]:
grouped.groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [93]:
grouped.size()

A
bar    3
foo    5
dtype: int64

In [96]:
grouped.describe()

        C                                                              \
    count      mean       std       min       25%       50%       75%
A
bar   3.0  0.755666  0.210510  0.530011  0.660125  0.790238  0.868494
foo   5.0 -0.188004  1.656321 -2.303007 -1.365241  0.117235  0.776245

                  D                                                    \
          max count      mean       std       min       25%       50%
A
bar  0.946750   3.0 -0.911948  1.262989 -2.152640 -1.554029 -0.955417
foo  1.834747   5.0  0.280992  0.761611 -0.349089 -0.329209 -0.124828


          75%       max
A
bar -0.291601  0.372214
foo  0.978859  1.229227

In [97]:
ll = [['foo', 1], ['foo', 2], ['foo', 2], ['bar', 1], ['bar', 1]]

df4 = pd.DataFrame(ll, columns=["A", "B"])

df4

     A  B
0  foo  1
1  foo  2
2  foo  2
3  bar  1
4  bar  1

In [98]:
df4.groupby("A")["B"].nunique()

A
bar    1
foo    2
Name: B, dtype: int64

In [101]:
df

     A      B         C         D
0  foo    one -2.303007 -0.124828
1  bar    one  0.530011 -2.152640
2  foo    two -1.365241 -0.329209
3  bar  three  0.790238  0.372214
4  foo    two  1.834747  1.229227
5  bar    two  0.946750 -0.955417
6  foo    one  0.117235 -0.349089
7  foo  three  0.776245  0.978859

In [99]:
grouped = df.groupby("A")
grouped.groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [100]:
grouped[["C", "D"]].aggregate("sum")

            C         D
A
bar  2.266999 -2.735843
foo -0.940021  1.404960

In [103]:
grouped = df.groupby(["A", "B"])
grouped.groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [104]:
grouped.agg("sum")

                  C         D
A   B
bar one    0.530011 -2.152640
    three  0.790238  0.372214
    two    0.946750 -0.955417
foo one   -2.185772 -0.473917
    three  0.776245  0.978859
    two    0.469506  0.900018

In [105]:
grouped = df.groupby(["A", "B"], as_index=False)

grouped.agg("sum")

     A      B         C         D
0  bar    one  0.530011 -2.152640
1  bar  three  0.790238  0.372214
2  bar    two  0.946750 -0.955417
3  foo    one -2.185772 -0.473917
4  foo  three  0.776245  0.978859
5  foo    two  0.469506  0.900018

In [106]:
df.groupby("A", as_index=False)[["C", "D"]].agg("sum")

     A         C         D
0  bar  2.266999 -2.735843
1  foo -0.940021  1.404960

In [107]:
df.groupby(["A", "B"]).agg("sum").reset_index()

     A      B         C         D
0  bar    one  0.530011 -2.152640
1  bar  three  0.790238  0.372214
2  bar    two  0.946750 -0.955417
3  foo    one -2.185772 -0.473917
4  foo  three  0.776245  0.978859
5  foo    two  0.469506  0.900018

In [108]:
animals

   kind  height  weight
0   cat     9.1     7.9
1   dog     6.0     7.5
2   cat     9.5     9.9
3   dog    34.0   198.0
4  bird     5.0    20.0

In [109]:
animals.groupby("kind")[["height"]].agg(lambda x: set(x))

           height
kind
bird        {5.0}
cat    {9.1, 9.5}
dog   {34.0, 6.0}

In [141]:
type(animals.groupby("kind")[["height"]].agg(lambda x: set(x)).loc["cat", "height"])

set

In [114]:
animals.groupby("kind")[["height"]].agg(lambda x: x.astype(int).sum())

      height
kind
bird       5
cat       18
dog       40

In [140]:
type(animals.groupby("kind")[["height"]].agg(lambda x: x.astype(int)).loc["cat", "height"])

numpy.ndarray

In [142]:
grouped = df.groupby("A")

In [143]:
grouped["C"].agg(["sum", "mean", "std"])

          sum      mean       std
A
bar  2.266999  0.755666  0.210510
foo -0.940021 -0.188004  1.656321

In [144]:
grouped[["C", "D"]].agg(["sum", "mean", "std"])

            C                             D
          sum      mean       std       sum      mean       std
A
bar  2.266999  0.755666  0.210510 -2.735843 -0.911948  1.262989
foo -0.940021 -0.188004  1.656321  1.404960  0.280992  0.761611

In [148]:
(

    grouped["C"]

    .agg(["sum", "mean", "std"])

    .rename(columns={"sum": "foo", "mean": "bar", "std": "baz"})

)

          foo       bar       baz
A
bar  2.266999  0.755666  0.210510
foo -0.940021 -0.188004  1.656321

In [149]:
(

    grouped[["C", "D"]].agg(["sum", "mean", "std"]).rename(

        columns={"sum": "foo", "mean": "bar", "std": "baz"}

    )

)

            C                             D
          foo       bar       baz       foo       bar       baz
A
bar  2.266999  0.755666  0.210510 -2.735843 -0.911948  1.262989
foo -0.940021 -0.188004  1.656321  1.404960  0.280992  0.761611

In [150]:
grouped["C"].agg(["sum", "sum"])

          sum       sum
A
bar  2.266999  2.266999
foo -0.940021 -0.940021

In [151]:
(

    grouped[["C", "D"]].agg(["sum", "mean", "std"]).rename(

        columns={"sum": "foo", "mean": "foo", "std": "baz"}

    )

)

            C                             D
          foo       foo       baz       foo       foo       baz
A
bar  2.266999  0.755666  0.210510 -2.735843 -0.911948  1.262989
foo -0.940021 -0.188004  1.656321  1.404960  0.280992  0.761611

In [152]:
grouped["C"].agg([lambda x: x.max() - x.min(), lambda x: x.median() - x.mean()])

     <lambda_0>  <lambda_1>
A
bar    0.416739    0.034572
foo    4.137755    0.305239

In [153]:
animals

   kind  height  weight
0   cat     9.1     7.9
1   dog     6.0     7.5
2   cat     9.5     9.9
3   dog    34.0   198.0
4  bird     5.0    20.0

In [154]:
animals.groupby("kind").agg(

    min_height=pd.NamedAgg(column="height", aggfunc="min"),

    max_height=pd.NamedAgg(column="height", aggfunc="max"),

    average_weight=pd.NamedAgg(column="weight", aggfunc="mean"),

)

      min_height  max_height  average_weight
kind
bird         5.0         5.0           20.00
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

In [155]:
animals.groupby("kind").agg(

    min_height=("height", "min"),

    max_height=("height", "max"),

    average_weight=("weight", "mean"),

)

      min_height  max_height  average_weight
kind
bird         5.0         5.0           20.00
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

In [157]:
pd.NamedAgg(column="weight", aggfunc="sum")

NamedAgg(column='weight', aggfunc='sum')

In [156]:
animals.groupby("kind").agg(

    **{

        "total weight": pd.NamedAgg(column="weight", aggfunc="sum")

    }

)

      total weight
kind
bird          20.0
cat           17.8
dog          205.5

In [161]:
animals

   kind  height  weight
0   cat     9.1     7.9
1   dog     6.0     7.5
2   cat     9.5     9.9
3   dog    34.0   198.0
4  bird     5.0    20.0

In [163]:
tmp = animals.groupby("kind")

In [164]:
tmp.groups

{'bird': [4], 'cat': [0, 2], 'dog': [1, 3]}

In [169]:
tmp.height

In [162]:
animals.groupby("kind").height.agg(

    min_height="min",

    max_height="max",

)

      min_height  max_height
kind
bird         5.0         5.0
cat          9.1         9.5
dog          6.0        34.0

In [172]:
from functools import partial

# Custom function that needs extra parameters
def weighted_avg(data, weights):
    # Make sure data and weights align within each group
    return np.average(data, weights=weights.loc[data.index])

# Create sample data
df = pd.DataFrame({
    'kind': ['cat', 'cat', 'dog', 'dog'],
    'weight': [8, 10, 20, 25],
    'height': [30, 35, 60, 65],
    'importance': [1, 2, 1, 3]  # weights for weighted average
})

df

  kind  weight  height  importance
0  cat       8      30           1
1  cat      10      35           2
2  dog      20      60           1
3  dog      25      65           3

In [173]:
# Using partial to fix the weights parameter
weighted_avg_partial = partial(weighted_avg, weights=df['importance'])

# Use in named aggregation
result = df.groupby('kind').agg(
    **{
        'weighted_height': pd.NamedAgg(
            column='height', 
            aggfunc=weighted_avg_partial
        )
    }
)

In [174]:
result

      weighted_height
kind
cat         33.333333
dog         63.750000

In [177]:
from functools import partial

# Create partial function for 95th percentile
percentile_95 = partial(np.percentile, q=95)

result = df.groupby('kind').agg(
    **{
        'height_95th': pd.NamedAgg(
            column='height', 
            aggfunc=percentile_95
        )
    }
)

result

      height_95th
kind
cat         34.75
dog         64.75

In [178]:
grouped.groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [179]:
grouped.agg({"C": "sum", "D": lambda x: np.std(x, ddof=1)})

            C         D
A
bar  2.266999  1.262989
foo -0.940021  0.761611

In [180]:
grouped.agg({"C": "sum", "D": "std"})

            C         D
A
bar  2.266999  1.262989
foo -0.940021  0.761611